Old CVS Repo/Google APIs/soap-samples/doSpellingSuggestion.xml,v

head	1.1;
access;
symbols;
locks; strict;
comment	@# @;


1.1
date	2006.06.05.09.33.04;	author jk;	state Exp;
branches;
next	;
deltatype	text;
kopt	kv;
permissions	666;
commitid	11b04483fa4f3004;
filename	doSpellingSuggestion.xml;


desc
@@


1.1
log
@*** empty log message ***
@
text
@<?xml version='1.0' encoding='UTF-8'?>

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:xsd="http://www.w3.org/1999/XMLSchema">
  <SOAP-ENV:Body>
    <ns1:doSpellingSuggestion xmlns:ns1="urn:GoogleSearch"
        SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <key xsi:type="xsd:string">00000000000000000000000000000000</key>
      <phrase xsi:type="xsd:string">britney speers</phrase>
    </ns1:doSpellingSuggestion>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
@
